SVN.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SVN aliases</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Fabrice Niessen" />
<meta name="description" content="Pretty format for `git log' and different helpful command aliases"
 />
<meta name="keywords" content="git, log, pretty format, alias" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">SVN aliases</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc5d0019">Use colordiff</a></li>
<li><a href="#org080e6d1">Subversion equivalent to Git commands</a>
<ul>
<li><a href="#org87f06b3">One-line log format (&rsquo;git log&rsquo;)</a></li>
<li><a href="#org58d1362">Show a single revision (&rsquo;git show&rsquo;)</a></li>
<li><a href="#orgfab9301">Show what changed</a></li>
</ul>
</li>
<li><a href="#org1a8b5c8">View history of file</a></li>
<li><a href="#orgf2c0ef3">svn diff zip revision to deploy</a></li>
<li><a href="#orgefc5a7f">Others</a></li>
<li><a href="#org88fc5ca">Incoming</a></li>
<li><a href="#org4ace057">Incoming changes</a>
<ul>
<li><a href="#org950ab23">Check for modifications</a></li>
<li><a href="#org00d5068">Preview incoming changes</a></li>
</ul>
</li>
<li><a href="#org52b2b6e">SVN conflict</a></li>
<li><a href="#org267930c">Checkout a specific older version of the source code</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc5d0019" class="outline-2">
<h2 id="orgc5d0019">Use colordiff</h2>
<div class="outline-text-2" id="text-orgc5d0019">
<p>
Use <code>colordiff</code> for my <code>svn diff</code> command (set in <code>~/.subversion/config</code>):
</p>

<div class="org-src-container">
<pre class="src src-diff">diff-cmd = colordiff
</pre>
</div>
</div>
</div>

<div id="outline-container-org080e6d1" class="outline-2">
<h2 id="org080e6d1">Subversion equivalent to Git commands</h2>
<div class="outline-text-2" id="text-org080e6d1">
<p>
The following aliases are interesting for using SVN a bit like Git.
</p>
</div>

<div id="outline-container-org87f06b3" class="outline-3">
<h3 id="org87f06b3">One-line log format (&rsquo;git log&rsquo;)</h3>
<div class="outline-text-3" id="text-org87f06b3">
<p>
See <code>svn-log</code> in my Shell configuration.
</p>
</div>
</div>

<div id="outline-container-org58d1362" class="outline-3">
<h3 id="org58d1362">Show a single revision (&rsquo;git show&rsquo;)</h3>
<div class="outline-text-3" id="text-org58d1362">
<div class="org-src-container">
<pre class="src src-shell">svn diff -c 4795                        <span class="org-comment-delimiter"># </span><span class="org-comment">Or svn diff -r 4795:4792.</span>
</pre>
</div>

<p>
See <code>svn-show</code> and <code>svn-showtool</code> in my Shell configuration.
</p>
</div>
</div>

<div id="outline-container-orgfab9301" class="outline-3">
<h3 id="orgfab9301">Show what changed</h3>
<div class="outline-text-3" id="text-orgfab9301">
<p>
Output filenames of files changed in each commit:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn log -v
</pre>
</div>

<p>
See <code>svn-whatchanged</code> in my Shell configuration.
</p>
</div>
</div>
</div>

<div id="outline-container-org1a8b5c8" class="outline-2">
<h2 id="org1a8b5c8">View history of file</h2>
<div class="outline-text-2" id="text-org1a8b5c8">
<p>
To view all historical changes to a file in SVN:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn log -q path/to/file | grep <span class="org-string">"^r"</span> | awk <span class="org-string">'{print $1}'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">List of revisions.</span>
</pre>
</div>

<p>
See <code>svn-logfile</code> in my Shell configuration.
</p>

<div class="org-src-container">
<pre class="src src-shell">svn log --diff path/to/file
</pre>
</div>

<p>
See <code>svn-logfile-p</code> in my Shell configuration.
</p>
</div>
</div>

<div id="outline-container-orgf2c0ef3" class="outline-2">
<h2 id="orgf2c0ef3">svn diff zip revision to deploy</h2>
<div class="outline-text-2" id="text-orgf2c0ef3">
<p>
Make release package (get list of changed files via <code>svn diff</code> log and zip them):
</p>

<p>
svn-rev-patch:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">For one release only.</span>
svn diff -c 124 --summarize | cut -c 9- | xargs zip -9 patch.zip

<span class="org-comment-delimiter"># </span><span class="org-comment">For a range of releases.</span>
svn diff -r 123:124 --summarize | cut -c 9- | xargs zip -9 patch.zip
</pre>
</div>

<p>
This will create a ZIP file with the changed file(s) &#x2013; in an intact directory
structure &#x2013; from revision <code>123:HEAD</code>.
</p>

<div class="note">
<p>
The <code>-c REV</code> option is equivalent to <code>-r REV-1:REV</code>.
</p>

</div>
</div>
</div>

<div id="outline-container-orgefc5a7f" class="outline-2">
<h2 id="orgefc5a7f">Others</h2>
<div class="outline-text-2" id="text-orgefc5a7f">
<p>
We also supply four bash shell aliases that make status checks of your working
copy easier, add them to your <code>.bashrc</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> <span class="org-variable-name">svnl</span>=<span class="org-string">"svn log -r 1:HEAD -v"</span>       <span class="org-comment-delimiter"># </span><span class="org-comment">Show log messages.</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">svnm</span>=<span class="org-string">"svn status -u -q"</span>           <span class="org-comment-delimiter"># </span><span class="org-comment">Show locally/repository changed items.</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">svnn</span>=<span class="org-string">"svn status -q"</span>              <span class="org-comment-delimiter"># </span><span class="org-comment">Show locally changed items.</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">svns</span>=<span class="org-string">"svn status -u -q -v"</span>        <span class="org-comment-delimiter"># </span><span class="org-comment">Show status of all items.</span>
</pre>
</div>

<p>
To <b>compare all modified files</b> in your working copy with the <code>HEAD</code> revision in the
repository, use the following command:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> svn-diffall=<span class="org-string">"echo svn status | grep '^M' | awk '{print $2}' | xargs svn diff -r HEAD"</span>
</pre>
</div>

<p>
Colored <code>svn diff</code> command like <code>git diff</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> svn-diff=<span class="org-string">'svn diff --diff-cmd=colordiff --extensions=" -u --strip-trailing-cr --ignore-space-change " | less --quit-if-one-screen'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org88fc5ca" class="outline-2">
<h2 id="org88fc5ca">Incoming</h2>
<div class="outline-text-2" id="text-org88fc5ca">
<p>
<a href="http://stackoverflow.com/questions/182945/how-to-see-what-will-be-updated-from-repository-before-issuing-svn-update-comm">http://stackoverflow.com/questions/182945/how-to-see-what-will-be-updated-from-repository-before-issuing-svn-update-comm</a>
</p>

<p>
Depending on what you want to know between your working copy and the latest SVN
server repository, without updating your local working copy, here is what you
can do:
</p>

<p>
If you want to know what has been changed in SVN server repository, run command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn st -u
</pre>
</div>

<p>
If you want to know if the same file has been modified both in your local
working copy and in SVN server repository, run command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn st -u | grep -i <span class="org-string">"^M \{7\}\*"</span>
</pre>
</div>

<p>
If you want to get <b>list of files changed</b> between a particular revision and <code>HEAD</code>,
run the command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r revisionNumber:HEAD --summarize
</pre>
</div>

<p>
If you want to get a list of files changed between particular revisions, run the
command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r revisionNumber:anotherRevisionNumber --summarize
</pre>
</div>

<p>
If you want to know what content of a particular file has been changed in SVN
server repository compared with your working copy, run the command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r BASE:HEAD ./path/to/file
</pre>
</div>

<p>
If you want to know what contents of all the files have been changed in SVN
server repository compared with your working copy, run the command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r BASE:HEAD .
</pre>
</div>

<p>
If you want to get a <b>list of all files that were changed on the branch</b> (created,
say, at revision 22334) compared to what&rsquo;s on the trunk (without seeing files
that were changed on the trunk between when the branch was created and &ldquo;now&rdquo;):
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r 22334:HEAD --summarize &lt;url of the branch&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ace057" class="outline-2">
<h2 id="org4ace057">Incoming changes</h2>
<div class="outline-text-2" id="text-org4ace057">
</div><div id="outline-container-org950ab23" class="outline-3">
<h3 id="org950ab23">Check for modifications</h3>
<div class="outline-text-3" id="text-org950ab23">
<p>
Show which files are modified in the repository (with an <code>*</code>):
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> svn-incoming=<span class="org-string">'svn status -u | grep \*'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">svn log -r BASE:HEAD                    <span class="org-comment-delimiter"># </span><span class="org-comment">Equivalent of `git log'</span>
svn log --diff -r BASE:HEAD             <span class="org-comment-delimiter"># </span><span class="org-comment">Equivalent of `git log -p'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org00d5068" class="outline-3">
<h3 id="org00d5068">Preview incoming changes</h3>
<div class="outline-text-3" id="text-org00d5068">
<p>
See what has been changed (how it&rsquo;s different from my working copy):
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r BASE:HEAD
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org52b2b6e" class="outline-2">
<h2 id="org52b2b6e">SVN conflict</h2>
<div class="outline-text-2" id="text-org52b2b6e">
<p>
Quand problème avec psvn, s&rsquo;en sortir en faisant :
</p>

<div class="org-src-container">
<pre class="src src-shell">svn status (-q)
svn resolved (FILE)
svn status (-q)
</pre>
</div>
</div>
</div>

<div id="outline-container-org267930c" class="outline-2">
<h2 id="org267930c">Checkout a specific older version of the source code</h2>
<div class="outline-text-2" id="text-org267930c">
<p>
Assuming that the source has already been checked out (that is you have an
already existing folder&#x2026;), update the revision (say we want to get r4732):
</p>

<div class="org-src-container">
<pre class="src src-shell">svn update -r 4732
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fabrice Niessen</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
